{
  "backend/main.mo": "Defines product, cart, order, and user profile types plus access-controlled functions for managing products, profiles, carts, and orders.",
  "feature_evidence.json": "Feature evidence report mapping features to related files, components, and tests for SEO, metadata, and help page additions.",
  "frontend-file-summaries.txt": "Lists concise descriptions of multiple frontend files including components, pages, hooks, and styles.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "HTML entry point with SEO meta tags, dynamic canonical/OG URL script, and root mounting point.",
  "frontend/public/robots.txt": "Allows all crawlers and points to sitemap.xml.",
  "frontend/public/sitemap.xml": "Static sitemap listing homepage and products routes with changefreq and priority.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, and global layout including new Help page route.",
  "frontend/src/components/admin/AdminGate.tsx": "Protects admin-only sections by checking admin status and showing an access denied card if unauthorized.",
  "frontend/src/components/auth/AuthGate.tsx": "Blocks access to protected pages until the user signs in via Internet Identity.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button that handles authentication and resets cached queries on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Shows a modal prompting newly authenticated users to set their profile name and saves it.",
  "frontend/src/components/branding/BrandLogo.tsx": "Displays the Buyflow logo image and text.",
  "frontend/src/components/branding/HomeHero.tsx": "Homepage hero section with background image, tagline, and link to the products page.",
  "frontend/src/components/cart/CartIndicator.tsx": "Cart icon button showing total item count and linking to the cart page.",
  "frontend/src/components/categories/CategoryStrip.tsx": "Fetches and displays product categories as clickable cards with emojis.",
  "frontend/src/components/forms/ShippingAddressForm.tsx": "Form for entering shipping details that builds and emits a combined address string and country value.",
  "frontend/src/components/Header/StoreHeader.tsx": "Responsive header with logo, search bar, cart indicator, orders link, and login button.",
  "frontend/src/components/Layout/AppLayout.tsx": "App layout with header, main content, footer, and link to Help page.",
  "frontend/src/components/orders/OrderCard.tsx": "Displays an order summary with date, total, item count, and link to detailed view.",
  "frontend/src/components/products/ProductCard.tsx": "Product display card showing image, price, stock status, rating, and linking to the product page.",
  "frontend/src/components/products/ProductGrid.tsx": "Responsive product grid layout with loading skeletons and empty-state messaging.",
  "frontend/src/components/search/SearchBar.tsx": "Search input that navigates to the products page with a query parameter.",
  "frontend/src/hooks/queries/useAdminProducts.ts": "React Query mutations for adding, updating, and adjusting stock of products with cache invalidation and toasts.",
  "frontend/src/hooks/queries/useCart.ts": "Provides React Query hooks for fetching and mutating cart data via the backend actor, including add, update, remove, and clear operations.",
  "frontend/src/hooks/queries/useOrders.ts": "Implements hooks to list, fetch, and place orders, invalidating related queries and handling errors with toasts.",
  "frontend/src/hooks/queries/useProducts.ts": "Defines product query hooks for listing, searching, and fetching products and categories using the actor API.",
  "frontend/src/hooks/queries/useUser.ts": "Exposes hooks to get and update the caller's user profile, role, and admin status through the actor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on identity, auto-initializing access control and invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for handling Internet Identity authentication, including login, logout, identity loading, and status tracking.",
  "frontend/src/index.css": "Tailwind CSS setup with custom CSS variables defining light and dark mode color themes and base typography.",
  "frontend/src/main.tsx": "Application entry point that initializes React, React Query, and Internet Identity provider wrapping the root App component.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin page for adding, editing, and managing products with forms, tabs, and React Query mutations for product and stock updates.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart UI with product details, quantity updates, removal, clearing, and navigation, using cart and product hooks.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements the checkout flow with cart summary, shipping form, payment selection, validation, and order placement.",
  "frontend/src/pages/HelpPage.tsx": "Displays help content including public URL sharing and instructions for Google Search indexing.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page with hero section, categories, and a featured products grid.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows order confirmation details including payment method and navigation to order info pages.",
  "frontend/src/pages/OrderDetailPage.tsx": "Displays detailed order info such as items, totals, shipping address, and timestamps.",
  "frontend/src/pages/OrdersPage.tsx": "Lists all orders for the user with loading, empty, and populated states.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays product details, stock info, and supports adding items to the cart.",
  "frontend/src/pages/ProductListPage.tsx": "Shows products filtered by search or category with dynamic titles and loading states.",
  "frontend/src/utils/paymentMethod.ts": "Maps backend PaymentMethod enum values to human-readable labels, currently supporting COD.",
  "frontend/src/utils/publicUrl.ts": "Provides utilities to get the public origin URL and copy text to the clipboard with fallbacks.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, typography, animations, and plugin setup.",
  "project_state.json": "Project metadata detailing the e-commerce app’s requirements, features, and architecture notes."
}