{
  "kind": "build_request",
  "title": "Add a public Buyflow URL & search-engine discoverability basics",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Add static SEO/discoverability files for Buyflow so search engines can crawl the site when it is hosted at a public URL (e.g., ICP domain or custom domain): include a robots.txt that allows crawling, and a sitemap.xml that lists the main routes (/, /products).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "You can make buyflow url"
        ]
      },
      "acceptanceCriteria": [
        "A robots.txt file is served from /robots.txt and does not block crawling of the site.",
        "A sitemap.xml file is served from /sitemap.xml and includes at least the homepage and products listing URLs.",
        "Both files are included as static assets (not generated by the backend) and are accessible when the app is deployed."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Improve HTML metadata for sharing and indexing by adding standard meta tags to the HTML entry point: meta description, canonical URL support, and Open Graph basic tags (title, description, url) using the Buyflow brand name and English text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "You can make buyflow url"
        ]
      },
      "acceptanceCriteria": [
        "The HTML head includes an English meta description appropriate for a marketplace branded as Buyflow.",
        "A canonical URL is present (either derived from the current origin at runtime or from a configurable public site URL).",
        "Open Graph tags are present for title, description, and URL, and reflect the Buyflow branding."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Add a simple user-facing page or section in the UI that shows the app’s current public URL (origin) and provides a one-click “Copy URL” action so users can open Buyflow directly in any browser (Chrome/Safari/Firefox) without needing someone to send them a link manually.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "You can make buyflow url"
        ]
      },
      "acceptanceCriteria": [
        "There is a visible UI location (e.g., footer link, header menu item, or a small page) that displays the current site URL in text.",
        "A “Copy URL” control copies the displayed URL to the clipboard and shows a clear success message in English.",
        "The displayed URL matches window.location.origin when accessed in the browser."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Add an in-app help section (English) that explains what is required to make Buyflow discoverable on Google Search (e.g., submit the public URL in Google Search Console) and clarify that a custom domain/DNS setup is outside the app code but the app provides the needed SEO files and metadata.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Put buyflow on google search ,safari, firefox,chrome everywhere"
        ]
      },
      "acceptanceCriteria": [
        "The help section is accessible from within the app and written in English.",
        "The help section explicitly mentions Google Search Console submission as the step for Google indexing.",
        "The help section clearly states that custom domain/DNS configuration is an external setup step, not handled by application code."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only Shadcn UI components).",
    "Do not add any external backend services or third-party APIs for SEO/indexing; use static assets and HTML metadata only.",
    "Do not change the single-actor backend architecture; this request should not require backend changes."
  ],
  "nonGoals": [
    "Purchasing/checkout logic changes.",
    "Adding third-party authentication or any non-Internet-Identity auth.",
    "Guaranteeing Google ranking or immediate indexing (only provide the technical prerequisites and guidance).",
    "Implementing DNS/custom-domain registration inside the app."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [
      "Make Buyflow accessible via a public URL and improve discoverability via basic SEO assets/metadata."
    ],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for user-facing help/instructions related to URL and indexing."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}