{
  "kind": "build_request",
  "title": "Implement full Admin Panel product management UI for Buyflow (/admin)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-28",
      "text": "Ensure the \"/admin\" route renders a full Admin Panel product-management experience (not a placeholder view that only shows the signed-in principal ID), including: (1) an Add/Edit Product form and (2) a Manage Products list for editing and stock updates; access must remain restricted via the existing AdminGate so non-admin users see an \"Access Denied\" screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "User: \"When I click on the admin panel it only show me the principal id\"",
          "Assistant: \"Pick one: 1. Simple admin panel 2. Full admin panel\"",
          "User: \"2\""
        ]
      },
      "acceptanceCriteria": [
        "When an authenticated admin user navigates to \"/admin\", they see an \"Admin Panel\" screen with product-management UI (Add/Edit and Manage views), not only a principal ID view.",
        "When a non-admin authenticated user navigates to \"/admin\", they see an \"Access Denied\" screen (in English) with a working \"Go to Home\" action.",
        "When a not-signed-in user navigates to \"/admin\", they are prompted to sign in (via the existing authentication flow) before admin checks occur."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Upgrade the Admin Panel Add/Edit Product form to support a \"full\" workflow for product fields already supported by the backend: title, description, price, currency, category, imageUrl, rating (optional), and stock. Add admin-friendly UX features: inline validation with clear English error messages, an image preview for the entered imageUrl, and category assistance (suggest existing categories from the catalog while still allowing free-text entry).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "User: \"2\""
        ]
      },
      "acceptanceCriteria": [
        "The Add/Edit Product form prevents submission and shows clear English validation messages when required fields are missing/invalid (e.g., empty title, empty category, non-numeric price, negative/empty stock).",
        "When an image URL is entered, the form shows a live preview of the image (and a clear English error/placeholder state if the image fails to load).",
        "The category input offers suggestions sourced from existing product categories (while still allowing admins to type a new category).",
        "On successful add/update, the UI shows a success confirmation (toast or inline message) in English and the products list reflects the change without a manual refresh."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Upgrade the Admin Panel \"Manage Products\" view to better support ongoing catalog management by adding: loading/empty states, an at-a-glance product thumbnail (from imageUrl), and safer stock editing UX (validate numeric input; avoid sending invalid/empty values). Keep all user-facing text in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "User: \"2\""
        ]
      },
      "acceptanceCriteria": [
        "The Manage Products view shows an English loading state while products are being fetched and an English empty state if there are no products.",
        "Each product row displays a small thumbnail preview based on the product’s imageUrl (with a graceful fallback if the image fails to load).",
        "Stock updates only submit valid numeric values; invalid/empty input does not trigger an update and shows a clear English message.",
        "Editing a product from the list reliably populates the Add/Edit Product form with the selected product’s current values."
      ]
    }
  ],
  "constraints": [
    "Frontend must not modify any files under frontend/src/components/ui (Shadcn components must be composed, not edited).",
    "Frontend must not edit immutable paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep backend as a single Motoko actor in backend/main.mo; only add migration.mo if an upgrade of stable state is required.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Adding external database/storage or image upload to external services.",
    "Implementing real-time updates via WebSockets or chat-like functionality.",
    "Changing core shopping/checkout flows unrelated to admin product management."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}