{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Buyflow Admin Panel product management UI (/admin)",
  "requirements": [
    {
      "id": "REQ-28",
      "summary": "Make /admin render a full product-management Admin Panel (Add/Edit + Manage) while keeping access restricted via existing AdminGate with correct sign-in-first behavior and Access Denied UI for non-admins.",
      "acceptanceCriteria": [
        "When an authenticated admin user navigates to \"/admin\", they see an \"Admin Panel\" screen with product-management UI (Add/Edit and Manage views), not only a principal ID view.",
        "When a non-admin authenticated user navigates to \"/admin\", they see an \"Access Denied\" screen (in English) with a working \"Go to Home\" action.",
        "When a not-signed-in user navigates to \"/admin\", they are prompted to sign in (via the existing authentication flow) before admin checks occur."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AdminGate.tsx",
          "operation": "modify",
          "description": "Update the gate flow to prompt sign-in first (compose the existing AuthGate when identity is missing), then perform admin checks and show the existing English Access Denied screen with working \"Go to Home\" action. Use the authorization component’s frontend guidance (role-based access control + graceful authorization error handling); verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminProductsPage.tsx",
          "operation": "modify",
          "description": "Refactor the /admin page to present a complete Admin Panel experience (tabs for Add/Edit Product and Manage Products) and ensure it remains wrapped by AdminGate (no principal-id-only placeholder UI). Wire editing actions to switch to the Add/Edit tab when a product is selected. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Confirm the \"/admin\" route is registered to the AdminProductsPage and remains accessible only through the AdminGate behavior (no new routes added). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Enhance the Admin Add/Edit Product form to support all backend-supported fields with inline validation, imageUrl preview with fallback/error state, and category suggestions sourced from existing catalog categories while allowing free text.",
      "acceptanceCriteria": [
        "The Add/Edit Product form prevents submission and shows clear English validation messages when required fields are missing/invalid (e.g., empty title, empty category, non-numeric price, negative/empty stock).",
        "When an image URL is entered, the form shows a live preview of the image (and a clear English error/placeholder state if the image fails to load).",
        "The category input offers suggestions sourced from existing product categories (while still allowing admins to type a new category).",
        "On successful add/update, the UI shows a success confirmation (toast or inline message) in English and the products list reflects the change without a manual refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/ProductUpsertForm.tsx",
          "operation": "create",
          "description": "Create a dedicated Add/Edit Product form component that supports title, description, price, currency, category, imageUrl, optional rating, and stock; provide inline validation with clear English messages; show a live image preview for imageUrl with graceful fallback to frontend/public/assets/generated/product-placeholder.dim_800x800.png when empty/invalid and an English error state when loading fails; and implement category suggestions using useGetSupportedCategories while still permitting free-text entry. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/adminProductValidation.ts",
          "operation": "create",
          "description": "Add shared form parsing/validation helpers for admin product inputs (e.g., required checks, numeric parsing, non-negative stock, optional rating handling) returning structured English error messages for inline display. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminProductsPage.tsx",
          "operation": "modify",
          "description": "Compose the new ProductUpsertForm into the Add/Edit tab; source category suggestions from useGetSupportedCategories; ensure successful add/update triggers UI confirmation (toast or inline) and refreshes the products list without manual refresh. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/queries/useAdminProducts.ts",
          "operation": "modify",
          "description": "Ensure admin product mutations invalidate the same React Query cache keys used by product listing/detail queries (e.g., invalidate the list-all and any product/detail keys) so the Manage Products list updates immediately after add/update. Keep all user-facing toast text in English. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Improve the Admin Manage Products view with loading/empty states, product thumbnails, and safer validated stock editing that avoids sending invalid updates; ensure edit-from-list reliably populates the Add/Edit form.",
      "acceptanceCriteria": [
        "The Manage Products view shows an English loading state while products are being fetched and an English empty state if there are no products.",
        "Each product row displays a small thumbnail preview based on the product’s imageUrl (with a graceful fallback if the image fails to load).",
        "Stock updates only submit valid numeric values; invalid/empty input does not trigger an update and shows a clear English message.",
        "Editing a product from the list reliably populates the Add/Edit Product form with the selected product’s current values."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/ManageProductsTable.tsx",
          "operation": "create",
          "description": "Create a Manage Products component that renders loading/empty states in English, shows an at-a-glance thumbnail for each product using imageUrl with fallback to frontend/public/assets/generated/product-placeholder.dim_800x800.png, and provides safer stock editing (client-side numeric validation, prevent submit on empty/invalid, show clear English inline errors per row). Include an \"Edit\" action that calls back with the selected product. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminProductsPage.tsx",
          "operation": "modify",
          "description": "Compose ManageProductsTable into the Manage tab using useListAllProducts loading/data states; connect stock-update actions to useUpdateStock while preventing invalid submissions; and ensure selecting \"Edit\" from the list populates the Add/Edit form and switches focus to the Add/Edit tab. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/queries/useProducts.ts",
          "operation": "modify",
          "description": "Ensure useListAllProducts returns/uses React Query loading and error states as needed by the Manage Products view (loading + empty handling). Keep user-facing text in English (rendered by the consuming view). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}