{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add public URL visibility and SEO/discoverability basics for Buyflow",
  "requirements": [
    {
      "id": "REQ-17",
      "summary": "Serve static robots.txt and sitemap.xml to allow crawling and list main routes.",
      "acceptanceCriteria": [
        "A robots.txt file is served from /robots.txt and does not block crawling of the site.",
        "A sitemap.xml file is served from /sitemap.xml and includes at least the homepage and products listing URLs.",
        "Both files are included as static assets (not generated by the backend) and are accessible when the app is deployed."
      ],
      "file_operations": [
        {
          "path": "frontend/public/robots.txt",
          "operation": "create",
          "description": "Add a permissive robots.txt (e.g., allow all) so crawlers are not blocked. Keep it static and deployable as-is."
        },
        {
          "path": "frontend/public/sitemap.xml",
          "operation": "create",
          "description": "Add a static sitemap.xml that lists the main routes (at minimum / and /products). Use absolute URLs with a configurable base (if supported by the hosting setup) or document that the base URL may need updating per deployment."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Enhance HTML head metadata with description, canonical URL support, and Open Graph tags using Buyflow branding.",
      "acceptanceCriteria": [
        "The HTML head includes an English meta description appropriate for a marketplace branded as Buyflow.",
        "A canonical URL is present (either derived from the current origin at runtime or from a configurable public site URL).",
        "Open Graph tags are present for title, description, and URL, and reflect the Buyflow branding."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add standard meta tags in the head: an English meta description for Buyflow, Open Graph basic tags (og:title, og:description, og:url), and canonical URL support. Implement canonical + og:url so they reflect the deployed public origin at runtime (or via a single configurable public site URL if available), without backend generation."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Add a user-facing in-app location that displays the current public origin and provides a one-click Copy URL action with success feedback.",
      "acceptanceCriteria": [
        "There is a visible UI location (e.g., footer link, header menu item, or a small page) that displays the current site URL in text.",
        "A “Copy URL” control copies the displayed URL to the clipboard and shows a clear success message in English.",
        "The displayed URL matches window.location.origin when accessed in the browser."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HelpPage.tsx",
          "operation": "create",
          "description": "Create a Help page section that shows the current public URL (derived from window.location.origin) and includes a “Copy URL” button that copies the value to the clipboard and shows a clear English success toast/message. Use existing shadcn-ui components for layout/controls where helpful; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/publicUrl.ts",
          "operation": "create",
          "description": "Add a small utility to compute the current public origin safely in the browser (and handle non-browser environments defensively) and a helper for copy-to-clipboard with a fallback path when clipboard permissions are unavailable."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new Help page into the TanStack Router route tree (e.g., /help) by importing and registering the new page so it is navigable."
        },
        {
          "path": "frontend/src/components/Layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Add a visible navigation entry (e.g., footer link) to the Help page so users can find the public URL and copy action from within the app."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Add an in-app English help section explaining Google indexing prerequisites and what is outside app scope (custom domain/DNS).",
      "acceptanceCriteria": [
        "The help section is accessible from within the app and written in English.",
        "The help section explicitly mentions Google Search Console submission as the step for Google indexing.",
        "The help section clearly states that custom domain/DNS configuration is an external setup step, not handled by application code."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HelpPage.tsx",
          "operation": "modify",
          "description": "Expand the Help page with an English help section that explains how to make Buyflow discoverable on Google (including submitting the public URL in Google Search Console) and explicitly clarifies that custom domain/DNS setup is an external step outside the app code. Use existing shadcn-ui components for readable info layout if needed; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}